In [1]:
import pandas as pd

df = pd.DataFrame({
    "미국": [2.1, 2.2, 2.3],
    "한국": [0.4, 0.4, 0.45],
    "중국": [10, 13, 15]
})

df

    미국    한국  중국
0  2.1  0.40  10
1  2.2  0.40  13
2  2.3  0.45  15

In [2]:
import pandas as pd

df = pd.DataFrame({
    "미국": [2.1, 2.2, 2.3],
    "한국": [0.4, 0.4, 0.45],
    "중국": [10, 13, 15]
}, index=[2000, 2010, 2020])

df

       미국    한국  중국
2000  2.1  0.40  10
2010  2.2  0.40  13
2020  2.3  0.45  15

In [3]:
df.index

Index([2000, 2010, 2020], dtype='int64')

In [4]:
df.index = [2001, 2002, 2003]

In [5]:
df

       미국    한국  중국
2001  2.1  0.40  10
2002  2.2  0.40  13
2003  2.3  0.45  15

In [6]:
df.columns

Index(['미국', '한국', '중국'], dtype='object')

In [7]:
df.columns = ["일본", "필리핀", "러시아"]

In [8]:
df

       일본   필리핀  러시아
2001  2.1  0.40   10
2002  2.2  0.40   13
2003  2.3  0.45   15

In [9]:
df.values

array([[ 2.1 ,  0.4 , 10.  ],
       [ 2.2 ,  0.4 , 13.  ],
       [ 2.3 ,  0.45, 15.  ]])

In [11]:
import pandas as pd

df = pd.DataFrame({
    "년도": [2000, 2010, 2020],
    "미국": [2.1, 2.2, 2.3],
    "한국": [0.4, 0.4, 0.45],
    "중국": [10, 13, 15]
})

df

     년도   미국    한국  중국
0  2000  2.1  0.40  10
1  2010  2.2  0.40  13
2  2020  2.3  0.45  15

In [14]:
df = df.set_index("년도")
df

       미국    한국  중국
년도
2000  2.1  0.40  10
2010  2.2  0.40  13
2020  2.3  0.45  15

In [15]:
df.index.name

'년도'

In [13]:
df = df.reset_index("년도")
df

     년도   미국    한국  중국
0  2000  2.1  0.40  10
1  2010  2.2  0.40  13
2  2020  2.3  0.45  15